posts/2010-02-18-caernarfon-dinorwig.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+INFOJS_OPT: view:info toc:t ltoc:nil
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:nil
#+TITLE: Coastal Cycle Ride from Caernarfon.
#+BEGIN_HTML
Date: 2010-02-18
Layout: post
Title: Coastal Cycle Ride from Caernarfon.
Tags: [cycling]
Category: blog

#+END_HTML
This week we have spent a few days in North Wales. We were very lucky
with the weather - it was cold and clear. Following a day walking we
wanted to do a short cycle ride. The children wanted it to be traffic
free and flat!

This ride, which is approximately four miles long, follows a
dismantled railway along the Menai Straight to the old port of
Dinorwig. There are good views over the Menai Straight to the island
of Anglesey.
** Starting Point and Route.
I am assuming that you start in Caernarfon, but you could of course
start in Dinorwig. You can park at the Victoria Dock next to the
Castle. Follow the one way system around the Castle and look out for
signs for Lon Las Menai, National Cycle Route 8. The route takes you
through the town to the Morrisons car park. There is alteernative
parking next to this, behind the old church, which is now a children's
play centre.

Descend from the Morrisons car park onto the old track next to the
Menai Straight. It's now simply a matter of following this to Y
Felinheli. Cycle along the waterfront towards the town to the Garddion
Inn. From the outside this looks quite run down. However, inside it's
very friendly with lots of interesting old photos and serves very good
food.

The return journey involves retracing your route back to Caernarfon.
