posts/2010-02-18-caernarfon-dinorwig/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Caernarfon Dinorwig | Ian's Blog.</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://ianbarton.co.uk/posts/2010-02-18-caernarfon-dinorwig/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Ian Barton.">
<link rel="prev" href="../2010-02-17-mynydd_mawr/" title="Mynydd Mawr" type="text/html">
<link rel="next" href="../2010-02-26-rab-generator-jacket/" title="Rab Generator Jacket" type="text/html">
<meta property="og:site_name" content="Ian's Blog.">
<meta property="og:title" content="Caernarfon Dinorwig">
<meta property="og:url" content="https://ianbarton.co.uk/posts/2010-02-18-caernarfon-dinorwig/">
<meta property="og:description" content="This week we have spent a few days in North Wales. We were very lucky
with the weather - it was cold and clear. Following a day walking we
wanted to do a short cycle ride. The children wanted it to be">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2010-02-18T17:46:27Z">
<meta property="article:tag" content="cycling">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://ianbarton.co.uk/">

            <span id="blog-title">Ian's Blog.</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100"></ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
            <div class="row">
<div class="col-md-8 blog-main">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Caernarfon Dinorwig</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Ian Barton.
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2010-02-18T17:46:27Z" itemprop="datePublished" title="2010-02-18 17:46">2010-02-18 17:46</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
This week we have spent a few days in North Wales. We were very lucky
with the weather - it was cold and clear. Following a day walking we
wanted to do a short cycle ride. The children wanted it to be traffic
free and flat!
</p>

<p>
This ride, which is approximately four miles long, follows a
dismantled railway along the Menai Straight to the old port of
Dinorwig. There are good views over the Menai Straight to the island
of Anglesey.
</p>
<div id="outline-container-org2425417" class="outline-2">
<h2 id="org2425417">Starting Point and Route.</h2>
<div class="outline-text-2" id="text-org2425417">
<p>
I am assuming that you start in Caernarfon, but you could of course
start in Dinorwig. You can park at the Victoria Dock next to the
Castle. Follow the one way system around the Castle and look out for
signs for Lon Las Menai, National Cycle Route 8. The route takes you
through the town to the Morrisons car park. There is alteernative
parking next to this, behind the old church, which is now a children's
play centre.
</p>

<p>
Descend from the Morrisons car park onto the old track next to the
Menai Straight. It's now simply a matter of following this to Y
Felinheli. Cycle along the waterfront towards the town to the Garddion
Inn. From the outside this looks quite run down. However, inside it's
very friendly with lots of interesting old photos and serves very good
food.
</p>

<p>
The return journey involves retracing your route back to Caernarfon.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/cycling/" rel="tag">cycling</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../2010-02-17-mynydd_mawr/" rel="prev" title="Mynydd Mawr">Previous post</a>
            </li>
            <li class="next">
                <a href="../2010-02-26-rab-generator-jacket/" rel="next" title="Rab Generator Jacket">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content-->
</div>
<aside class="col-md-4 blog-sidebar"><div class="sidebar-module sidebar-module-inset">
<h4>Search </h4>
<!-- Google custom search -->
<form method="get" action="https://www.google.com/search" class="navbar-form navbar-right" role="search">
<div class="form-group">
<input type="text" name="q" class="form-control" placeholder="Search">
</div>
<button type="submit" class="btn btn-primary">
	<span class="glyphicon glyphicon-search"></span>
</button>
<input type="hidden" name="sitesearch" value="%s">
</form>
<!-- End of custom search -->


  <h4><a href="../../pages/about/index.html">About.</a></h4>

</div>
<div class="sidebar-module">


  <h4>Links</h4>
  <ol class="list-unstyled">
<li><a href="../../categories/index.html">Tags</a></li>
    <li><a href="../../archive.html">Archive</a></li>
    <li><a href="http://getbootstrap.com/examples/blog/">Bootstrap Blog Theme</a></li>
    <li><a href="https://getnikola.com/">Nikola</a></li>
  </ol>
</div>
</aside>
</div>

        <footer id="footer">
            Contents © 2020         <a href="mailto:ian@ianbarton.co.uk">Ian Barton.</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
